// Advanced Hunting Query to find mail being detected as High Confidence Phish, and overriden by misconfiguration.
// This will highlight anything secure by default will affect
// Remove the ! infront of "!contains "Transport" to filter the mail which is being overriden by ETR (and not affected by secure by default)
// Ben H - 2021

EmailEvents
| where ConfidenceLevel contains '"Phish":"High"' and EmailDirection == "Inbound" and OrgLevelPolicy !contains "Transport"and OrgLevelAction == "Allow"
| project SenderFromAddress,SenderIPv4,RecipientEmailAddress,PhishDetectionMethod,OrgLevelAction,OrgLevelPolicy,NetworkMessageId



// General hunting queries for finding entires in your allow lists you might not want - these are just a starting point :)

// Edit the from domain and find mail in your allow-lists you don't need (or where you're letting in malicious mail)
EmailEvents 
|where EmailDirection == "Inbound" and SenderFromDomain contains "gmail.com"
|summarize count() by DetectionMethods

// Edit the IP and then use this to find entries in your connection filter you dont need (or where you're letting in malicious mail)
EmailEvents 
|where EmailDirection == "Inbound" and SenderIPv4 contains "{XX.XXX.X. - EDIT ME}"
|summarize count() by DetectionMethods

// Edit the senderfromaddress and then use this to find entries in your allow lists you dont need (or where you're letting in malicious mail)
EmailEvents 
|where EmailDirection == "Inbound" and SenderFromAddress == "SOMEONE@DOMAIN.COM"
|summarize count() by DetectionMethods
