//-------
//Teams Clicks Blocked by threat
//-------
UrlClickEvents
| where Workload == "Teams" and ActionType == "ClickBlocked"
| summarize count() by ThreatTypes
//-------
// - - - - - - - - - - - - - -
//-------
// Files Blocked by Workload
FileMaliciousContentInfo
| summarize count() by Workload
//-------
// - - - - - - - - - - - - - -
