//Phish Delivery Locations by Confidence
let _startTime = ago(30d); 
let _endTime = now(); 
    EmailEvents 
    | where Timestamp between (_startTime .. _endTime) and EmailDirection == "Inbound" 
    | where ThreatTypes contains "Phish" 
    | extend MDO_detection = parse_json(DetectionMethods) 
    | extend FirstDetection = iif(isempty(MDO_detection), "Clean", tostring(bag_keys(MDO_detection)[0])) 
    | extend FirstSubcategory = iif(FirstDetection != "Clean" and array_length(MDO_detection[FirstDetection]) > 0, strcat(FirstDetection, ": ", tostring(MDO_detection[FirstDetection][0])), "No Detection (clean)") 
    | where FirstDetection == "Phish" and DeliveryLocation != "Failed"
| extend ConfidenceLevelParsed = parse_json(ConfidenceLevel)
| extend
    PhishConfidenceLevel = tostring(ConfidenceLevelParsed.Phish),
    SpamConfidenceLevel  = tostring(ConfidenceLevelParsed.Spam)
| summarize count() by PhishConfidenceLevel,DeliveryLocation 

//Spam Delivery Locations by Confidence
let _startTime = ago(30d); 
let _endTime = now(); 
    EmailEvents 
    | where Timestamp between (_startTime .. _endTime) and EmailDirection == "Inbound" 
    | where ThreatTypes contains "Spam"
    | extend MDO_detection = parse_json(DetectionMethods) 
    | extend FirstDetection = iif(isempty(MDO_detection), "Clean", tostring(bag_keys(MDO_detection)[0])) 
    | extend FirstSubcategory = iif(FirstDetection != "Clean" and array_length(MDO_detection[FirstDetection]) > 0, strcat(FirstDetection, ": ", tostring(MDO_detection[FirstDetection][0])), "No Detection (clean)") 
    | where FirstDetection == "Spam" and DeliveryLocation != "Failed"
| extend ConfidenceLevelParsed = parse_json(ConfidenceLevel)
| extend
    PhishConfidenceLevel = tostring(ConfidenceLevelParsed.Phish),
    SpamConfidenceLevel  = tostring(ConfidenceLevelParsed.Spam)
| summarize count() by SpamConfidenceLevel,DeliveryLocation 
