// ThreatClassification breakdown - Inbound Phish (13/03/2026 1.0 - BH)
let _startTime = ago(30d); 
let _endTime = now(); 
EmailEvents
    | where ThreatClassification != "" and EmailDirection == "Inbound" and Timestamp between (_startTime .. _endTime)
    | where OrgLevelPolicy != "Phishing simulation" and OrgLevelPolicy != "SecOps Mailbox"    
    | where ThreatTypes contains "Phish"
    | extend MDO_detection = parse_json(DetectionMethods) 
    | extend FirstDetection = iif(isempty(MDO_detection), "Clean", tostring(bag_keys(MDO_detection)[0])) 
    | extend FirstSubcategory = iif(FirstDetection != "Clean" and array_length(MDO_detection[FirstDetection]) > 0, strcat(FirstDetection, ": ", tostring(MDO_detection[FirstDetection][0])), "No Detection (clean)") 
| summarize count() by ThreatClassification

https://security.microsoft.com/v2/advanced-hunting?query=H4sIAOn_s2kAA52UT2_TQBDF54zEdzA92RK0aZE4gMqBFgQSpUjNraoiJ1kSQ9JUtkMI6ofnt29txW6CadBq_3h2Z968N7s-siOLrG9Ty81ZaqWd2Yy5oGX2jT6SNbOF3XJyWJ37YWMsK9le0D-xGmJZMo_5_krEjBhT1rEd20twehpPmE_sFfZjO2Qd_N_ZR0vsqT0B3YEX2QDvEqScsU-sOfbITumpTUCKidYDK7E32NqeTlm0vW6Vb9w4_57dlDMzVj_lU4Lpd6Kq3dNXcHBivY9Oz4R5QPP5Bk02eOeMPs6o4XFaebSVbPrXfIIuc7tTPTznFaNTlPgvuh3StpVJOtleMk_sM2uvzoyaLhg903WD4abSGbEn2ApFX0qfml-Tx-PiXkmfS1gWfF9UynllfilaaI-tVp_Yd9IuIupCtU6VcfGAxcFWTAdiWSnnMzknqwFrJ2u7hhEoXvuCnYF9Z_Y7MT4PT1_IMmU95lSyg0sb94PujK_tdqyAnOkmxuLhdD9KWMcdGSf2XOzP9HZS1clbSnY9Ul7VNEZ3_-oGvHtHzOIfUa95mTfM-7C64sYMq1fk9MJz3Ycms24N6pvTZLO5db4qOeOanGfCn0j_LibXnYg34veW3pNqQbHAoDvXoPprjbv1_v-cNtoHlC_Yo516xXzVSiWcrKt1Ly5LbtBcqmX2W-9pVP2VSv1F_b9nvcc_8Q9SdA91agYAAA&timeRangeId=SetInQuery
