// ThreatClassification breakdown - Inbound Phish (13/03/2026 1.0 - BH)
let _startTime = ago(30d); 
let _endTime = now(); 
EmailEvents
| where ThreatClassification != "" and EmailDirection == "Inbound" and Timestamp between (_startTime .. _endTime)
    | where ThreatTypes contains "Phish"
    | extend MDO_detection = parse_json(DetectionMethods) 
    | extend FirstDetection = iif(isempty(MDO_detection), "Clean", tostring(bag_keys(MDO_detection)[0])) 
    | extend FirstSubcategory = iif(FirstDetection != "Clean" and array_length(MDO_detection[FirstDetection]) > 0, strcat(FirstDetection, ": ", tostring(MDO_detection[FirstDetection][0])), "No Detection (clean)") 
| summarize count() by ThreatClassification
